# © @III_MAA7NAV_III
from telethon import events, Button

from config import X1, SUDO_USERS, CMD_HNDLR as hl


HELP_STRING = f"<blockquote><b>📗 ᴅɪᴠє ɪηᴛσ ᴧʟʟ ᴄσϻϻᴧηᴅ ᴄᴧᴛєɢσʀɪєs ʙєʟσᴡ </blockquote>\n\n<blockquote>✧ ɢєᴛ ɢυɪᴅᴧηᴄє - ᴧssɪsᴛᴧηᴄє ɪη συʀ <a href='https://t.me/manavkiduniya'>sυᴘᴘσʀᴛ ᴄʜᴧᴛ</a> — ɪ'ϻ ʜєʀє ғσʀ ʏσυ!</b></blockquote>"

HELP_BUTTON = [
    [
      Button.inline("sᴘᴧϻ", data="spam"),
      Button.inline("ʀᴧɪᴅ", data="raid")
    ],
    [
      Button.inline("ϻσʀє", data="moreaxiomcmd"),
      Button.inline("ηєᴡ ᴄσϻϻᴧηᴅ", data="maanav")
    ]
  ]


@X1.on(events.NewMessage(incoming=True, pattern=r"\%shelp(?: |$)(.*)" % hl))
async def help(event):
    if event.sender_id in SUDO_USERS:
        try:
          await event.client.send_file(event.chat_id,
              "https://files.catbox.moe/1yzzii.png",
              caption=HELP_STRING,
              has_spoiler=True,
              parse_mode="html",
              buttons=HELP_BUTTON
              )
        except Exception as e:
            await event.client.send_message(event.chat_id, f"<b>⫸ An Exception Occured!\n\n⫸ERROR: {str(e)}")


moreaxiomcmd_msg = f"""
<b><u>⫸ ᴇxᴛʀᴀ  ᴄᴏᴍᴍᴀɴᴅs:</u></b>

 <blockquote><b>𝗨𝘀𝗲𝗿𝗕𝗼𝘁: ᴜsᴇʀʙᴏᴛ ᴄᴍᴅs
  ✧ {hl}𝙿𝚒𝚗𝚐
  ✧ {hl}reb𝚘𝚘𝚝
  ✧ {hl}𝚂𝚞𝚍𝚘 <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛>  --> Axiom Cmd
  ✧ {hl}𝚕𝚘𝚐𝚜 --> Axiom Cmd</b></blockquote

<blockquote><b> 𝗘𝗰𝗵𝗼: ᴛᴏ ᴀᴄᴛɪᴠᴇ ᴇᴄʜᴏ ᴏɴ ᴀɴʏ ᴜsᴇʀ
  ✧ {hl}𝚎𝚌𝚑𝚘 <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛>
  ✧ {hl}𝚛𝚖𝚎𝚌𝚑𝚘 <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b></blockquote

<blockquote><b> 𝗟𝗲𝗮𝘃𝗲: ᴛᴏ ʟᴇᴀᴠᴇ ɢʀᴏᴜᴘ/ᴄʜᴀɴɴᴇʟ
  ✧ {hl}𝚕𝚎𝚊𝚟𝚎 <𝚐𝚛𝚘𝚞𝚙/𝚌𝚑𝚊𝚝 𝚒𝚍>
  ✧ {hl}𝚕𝚎𝚊𝚟𝚎 : 𝚃𝚢𝚙𝚎 𝚒𝚗 𝚝𝚑𝚛 𝙶𝚛𝚘𝚞𝚘 𝚋𝚘𝚝 𝚠𝚒𝚕𝚕 𝚊𝚞𝚝𝚘 𝚕𝚎𝚊𝚟𝚎 𝚝𝚑𝚊𝚝 𝚐𝚛𝚘𝚞𝚙 </b></blockquote>

"""


raid_msg = f"""
<u><b>⫸ ʀᴀɪᴅ ᴄᴏᴍᴍᴀɴᴅs:</b></u>

<blockquote><b>𝗥𝗮𝗶𝗱: ᴀᴄᴛɪᴠᴀᴛᴇs ʀᴀɪᴅ ᴏɴ ᴀɴʏ ɪɴᴅɪᴠɪᴅᴜᴀʟ ᴜsᴇʀ ғᴏʀ ɢɪᴠᴇɴ ʀᴀɴɢᴇ
  ✧ {hl}𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b></blockquote>

<blockquote><b> 𝗥𝗲𝗽𝗹𝘆𝗥𝗮𝗶𝗱: ᴀᴄᴛɪᴠᴀᴛᴇs ʀᴇᴘʟʏ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚛𝚛𝚊𝚒𝚍 <𝚛𝚎𝚙𝚕𝚢𝚒𝚗𝚐 𝚝𝚘 𝚞𝚜𝚎𝚛>
  ✧ {hl}𝚛𝚛𝚊𝚒𝚍 <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚑𝚛𝚛𝚊𝚒𝚍 <𝚛𝚎𝚙𝚕𝚢𝚒𝚗𝚐 𝚝𝚘 𝚞𝚜𝚎𝚛>
  ✧ {hl}𝚑𝚛𝚛𝚊𝚒𝚍 <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎> </b></blockquote>

<blockquote><b> 𝗗𝗥𝗲𝗽𝗹𝘆𝗥𝗮𝗶𝗱: ᴅᴇᴀᴄᴛɪᴠᴀᴛᴇs ʀᴇᴘʟʏ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚍𝚛𝚛𝚊𝚒𝚍 <𝚛𝚎𝚙𝚕𝚢𝚒𝚗𝚐 𝚝𝚘 𝚞𝚜𝚎𝚛>
  ✧ {hl}𝚍𝚛𝚛𝚊𝚒𝚍 <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚍𝚑𝚛𝚊𝚒𝚍 <𝚛𝚎𝚙𝚕𝚢𝚒𝚗𝚐 𝚝𝚘 𝚞𝚜𝚎𝚛>
  ✧ {hl}𝚍𝚑𝚛𝚊𝚒𝚍 <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎> </b></blockquote>

<blockquote><b>𝐋𝐨𝐯𝐞 𝐑𝐚𝐢𝐝: ʟᴏᴠᴇ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚖𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚕𝚘𝚟𝚎𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎> </b></blockquote>

<blockquote><b>𝐇𝐢𝐧𝐝𝐢 𝐑𝐚𝐢𝐝: ʜɪɴᴅɪ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚑𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <username>
  ✧ {hl}𝚑𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b></blockquote>

<blockquote><b>𝐂𝐑𝐚𝐢𝐝: ᴀʙᴄᴅ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚌𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚌𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b></blockquote>


"""

maanav_msg = f"""
<u><b>⫸ ɴᴇᴡ ᴄᴏᴍᴍᴀɴᴅs:</b></u>

<blockquote><b>𝗚𝗼𝗼𝗱 𝗔𝗳𝘁𝗲𝗿𝗻𝗼𝗼𝗻: ᴀғᴛᴇʀ ɴᴏᴏɴ ʀᴀɪᴅ ᴏɴ ᴀɴʏ ɪɴᴅɪᴠɪᴅᴜᴀʟ ᴜsᴇʀ ғᴏʀ ɢɪᴠᴇɴ ʀᴀɴɢᴇ
  ✧ {hl}𝚐𝚊 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚐𝚊 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b></blockquote>

<blockquote><b>𝗘𝗺𝗼𝗷𝗶: ᴇᴍᴏᴊɪ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚎𝚖𝚘𝚓𝚒 <𝚛𝚎𝚙𝚕𝚢𝚒𝚗𝚐 𝚝𝚘 𝚞𝚜𝚎𝚛>
  ✧ {hl}𝚎𝚖𝚘𝚓𝚒 <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎> </b></blockquote>

<blockquote><b>𝗚𝗼𝗼𝗱 𝗠𝗼𝗿𝗻𝗶𝗻𝗴: ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚐𝚖 <𝚛𝚎𝚙𝚕𝚢𝚒𝚗𝚐 𝚝𝚘 𝚞𝚜𝚎𝚛>
  ✧ {hl}𝚐𝚖 <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎> </b></blockquote>

<blockquote><b>𝗚𝗼𝗼𝗱 𝗡𝗶𝗴𝗵𝘁: ɢᴏᴏᴅ ɴɪɢʜᴛ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚐𝚗 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚐𝚗 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b</blockquote>

<blockquote><b>𝗦𝗵𝗮𝘆𝗿𝗶 𝗥𝗮𝗶𝗱: sʜʏʀɪ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚜𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <username>
  ✧ {hl}𝚜𝚛𝚊𝚒𝚍 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b></blockquote>

<blockquote><b>𝗙𝗹𝗶𝗿𝘁𝗶𝗻𝗴: ғʟɪʀᴛ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚏𝚕𝚒𝚛𝚝 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚏𝚕𝚒𝚛𝚝 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b></blockquote>

<blockquote><b>𝗕𝗶𝗿𝘁𝗵𝗱𝗮𝘆: ғʟɪʀᴛ ʀᴀɪᴅ ᴏɴ ᴛʜᴇ ᴜsᴇʀ
  ✧ {hl}𝚋𝚜𝚙𝚊𝚖 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎>
  ✧ {hl}𝚋𝚜𝚙𝚊𝚖 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚞𝚜𝚎𝚛> </b></blockquote>


"""

spam_msg = f"""
<b><u>⫸ sᴘᴀᴍ ᴄᴏᴍᴍᴀɴᴅs:</u></b>

<blockquote><b>𝗦𝗽𝗮𝗺: sᴘᴀᴍs ᴀ ᴍᴇssᴀɢᴇ
  ✧ {hl}𝚂𝚙𝚊𝚖 <𝚌𝚘𝚞𝚗𝚝> <𝚖𝚎𝚜𝚜𝚊𝚐𝚎 𝚝𝚘 𝚜𝚙𝚊𝚖> (𝚢𝚘𝚞 𝚌𝚊𝚗 𝚛𝚎𝚙𝚕𝚢 𝚊𝚗𝚢 𝚖𝚎𝚜𝚜𝚊𝚐𝚎 𝚒𝚏 𝚢𝚘𝚞 𝚠𝚊𝚗𝚝 𝚋𝚘𝚝 𝚝𝚘 𝚛𝚎𝚙𝚕𝚢 𝚝𝚑𝚊𝚝 𝚖𝚎𝚜𝚜𝚊𝚐𝚎 𝚊𝚗𝚍 𝚍𝚘 𝚜𝚙𝚊𝚖𝚖𝚒𝚗𝚐)
  ✧ {hl}𝚜𝚙𝚊𝚖 <𝚌𝚘𝚞𝚗𝚝> <𝚛𝚎𝚙𝚕𝚢𝚒𝚗𝚐 𝚊𝚗𝚢 𝚖𝚎𝚜𝚜𝚊𝚐𝚎> </b></blockquote>

<blockquote><b>𝗣𝗼𝗿𝗻𝗦𝗽𝗮𝗺: ᴘᴏʀɴᴏɢʀᴀᴘʜʏ  sᴘᴀᴍ
  ✧ {hl}𝙿𝚜𝚙𝚊𝚖 <𝚌𝚘𝚞𝚗𝚝> </b></blockquote>

<blockquote><b>𝗛𝗮𝗻𝗴: sᴘᴀᴍs ʜᴀɴɢ ᴍᴇssᴀɢᴇ ғᴏʀ ɢɪᴠᴇɴ ᴄᴏᴜɴᴛᴇʀs
  ✧ {hl}𝚑𝚊𝚗𝚐 <𝚌𝚘𝚞𝚗𝚝𝚎𝚛> </b></blockquote>

<blockquote><b>𝗔𝗯𝘂𝘀𝗲𝗦𝗽𝗮𝗺: ᴏɴᴇ ᴡᴏʀᴅ ʙɪɢ ɢᴀᴀʟɪ sᴘᴀᴍ
  ✧ {hl}𝚊𝚋𝚞𝚜𝚎 <𝚌𝚘𝚞𝚗𝚝> <𝚞𝚜𝚎𝚛𝚗𝚊𝚖𝚎> </b></blockquote>
  

"""                     


@X1.on(events.CallbackQuery(pattern=r"help_back"))
async def helpback(event):
    if event.query.user_id in SUDO_USERS:    
        await event.edit(
            HELP_STRING,
            buttons=[
              [
                Button.inline("sᴘᴧϻ", data="spam"),
                Button.inline("ʀᴧɪᴅ", data="raid")
              ],
              [
                Button.inline("ϻσʀє", data="moreaxiomcmd")
              ],
              [
                Button.inline("ηєᴡ ᴄσϻϻᴧηᴅ", data="maanav")
              ]
            ]
          )
    else:
        await event.answer("✧ ʏσυ ᴧʀє ησᴛ ᴧυᴛʜσʀɪᴢєᴅ ᴘʟєᴧsє ᴄσηᴛᴧᴄᴛ <a href='https://t.me/iii_maa7nav_iii/30'>ᴧxɪσϻ</a> ᴛσ ᴛᴧᴋє sυᴅσ." , cache_time=0, alert=True)


@X1.on(events.CallbackQuery(pattern=r"spam"))
async def help_spam(event):
    if event.query.user_id in SUDO_USERS:    
        await event.edit(spam_msg,
              buttons=[[Button.inline("ʙᴧᴄᴋ ⟲", data="help_back"),],],
              ) 
    else:
        await event.answer("✧ ʏσυ ᴧʀє ησᴛ ᴧυᴛʜσʀɪᴢєᴅ ᴘʟєᴧsє ᴄσηᴛᴧᴄᴛ <a href='https://t.me/iii_maa7nav_iii/30'>ᴧxɪσϻ</a> ᴛσ ᴛᴧᴋє sυᴅσ.", cache_time=0, alert=True)


@X1.on(events.CallbackQuery(pattern=r"raid"))
async def help_raid(event):
    if event.query.user_id in SUDO_USERS:
        await event.edit(raid_msg,
            buttons=[[Button.inline("ʙᴧᴄᴋ ⟲", data="help_back"),],],
          )
    else:
        await event.answer("✧ ʏσυ ᴧʀє ησᴛ ᴧυᴛʜσʀɪᴢєᴅ ᴘʟєᴧsє ᴄσηᴛᴧᴄᴛ <a href='https://t.me/iii_maa7nav_iii/30'>ᴧxɪσϻ</a> ᴛσ ᴛᴧᴋє sυᴅσ.", cache_time=0, alert=True)


@X1.on(events.CallbackQuery(pattern=r"moreaxiomcmd"))
async def help_moreaxiomcmd(event):
    if event.query.user_id in SUDO_USERS:
        await event.edit(moreaxiomcmd_msg,
            buttons=[[Button.inline("ʙᴧᴄᴋ ⟲", data="help_back"),],],
            )
    else:
        await event.answer("✧ ʏσυ ᴧʀє ησᴛ ᴧυᴛʜσʀɪᴢєᴅ ᴘʟєᴧsє ᴄσηᴛᴧᴄᴛ <a href='https://t.me/iii_maa7nav_iii/30'>ᴧxɪσϻ</a> ᴛσ ᴛᴧᴋє sυᴅσ.", cache_time=0, alert=True)
        
        
@X1.on(events.CallbackQuery(pattern=r"maanav"))
async def help_maanav(event):
    if event.query.user_id in SUDO_USERS:
        await event.edit(maanav_msg,
            buttons=[[Button.inline("ʙᴧᴄᴋ ⟲", data="help_back"),],],
            )
    else:
        await event.answer("✧ ʏσυ ᴧʀє ησᴛ ᴧυᴛʜσʀɪᴢєᴅ ᴘʟєᴧsє ᴄσηᴛᴧᴄᴛ <a href='https://t.me/iii_maa7nav_iii/30'>ᴧxɪσϻ</a> ᴛσ ᴛᴧᴋє sυᴅσ.", cache_time=0, alert=True)
